turbulentFlatPlate_1/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
225
(
(-1757.9359 0 0)
(-1757.9359 0 0)
(-1757.9359 0 0)
(-1757.9359 0 0)
(-1757.9359 0 0)
(-1757.9359 0 0)
(-1757.9359 0 0)
(-1757.9359 0 0)
...
)
;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
