turbulentFlatPlate_1/Allrun
#!/bin/sh

blockMesh > log.blockMesh
simpleFoam > log.simpleFoam
touch turbulentFlatPlate_1.foam

# -----------------------------------------------------------------------------
