turbulentFlatPlate_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          193;
        startFace       104912;
    }
    outlet
    {
        type            patch;
        nFaces          193;
        startFace       105105;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          273;
        startFace       105298;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          225;
        startFace       105571;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          48;
        startFace       105796;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          105378;
        startFace       105844;
    }
)

// ************************************************************************* //
