turbulentFlatPlate_1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{
//     minMax
//     {
//         type          fieldMinMax;
//         libs          (fieldFunctionObjects);
//         writeControl  timeStep; //writeTime;
//         fields        (U);
//     }
//     yPlus
//     {
//         type            yPlus;
//         libs            (fieldFunctionObjects);
//         patches         (fixedWall);
//         writeControl    writeTime;
//     }
     #includeFunc "writeCellCentres"
     #includeFunc "wallShearStress"
}

// ************************************************************************* //
